# CantCopySymbolicElementToSelfOrientingFamily Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CantCopySymbolicElementToSelfOrientingFamily Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Cannot copy symbolic elements sketched in non-horizontal planes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantCopySymbolicElementToSelfOrientingFamily { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantCopySymbolicElementToSelfOrientingFamily As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantCopySymbolicElementToSelfOrientingFamily {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace